In [1]:
import pandas as pd

In [2]:
data = [{'Name': 'Alice', 'Age': 25, 'City': 'New York'},
        {'Name': 'Bob', 'Age': 30, 'City': 'London'},
        {'Name': 'Charlie', 'Age': 22, 'City': 'Paris'},
        {'Name': 'David', 'Age': 28, 'City': 'Tokyo'}]

df = pd.DataFrame(data)
print(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris
3    David   28     Tokyo

In [3]:
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris
3    David   28     Tokyo

In [8]:
df[['Name']]

      Name
0    Alice
1      Bob
2  Charlie
3    David

In [7]:
df[['Name','Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    David   28

In [4]:
# Select the row with index label 0
row_0 = df.loc[0]
print("Row with index 0:\n", row_0)

# Select multiple rows by label
rows_0_and_2 = df.loc[[0, 2]]
print("\nRows with index 0 and 2:\n", rows_0_and_2)

# Select a range of rows by label (inclusive of both endpoints)
rows_0_to_2 = df.loc[0:2]
print("\nRows from index 0 to 2:\n", rows_0_to_2)

Row with index 0:
 Name       Alice
Age           25
City    New York
Name: 0, dtype: object

Rows with index 0 and 2:
       Name  Age      City
0    Alice   25  New York
2  Charlie   22     Paris

Rows from index 0 to 2:
       Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris

In [5]:
# Select the row at integer position 0
row_at_0 = df.iloc[0]
print("Row at integer position 0:\n", row_at_0)

# Select multiple rows by integer position
rows_at_0_and_2 = df.iloc[[0, 2]]
print("\nRows at integer position 0 and 2:\n", rows_at_0_and_2)

# Select a range of rows by integer position (exclusive of the upper endpoint)
rows_0_to_2_iloc = df.iloc[0:3]
print("\nRows from integer position 0 to 2 (exclusive):\n", rows_0_to_2_iloc)

Row at integer position 0:
 Name       Alice
Age           25
City    New York
Name: 0, dtype: object

Rows at integer position 0 and 2:
       Name  Age      City
0    Alice   25  New York
2  Charlie   22     Paris

Rows from integer position 0 to 2 (exclusive):
       Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris

In [31]:
import pandas as pd

data = {'Product': ['A', 'B', 'A', 'C', 'B', 'C', 'A', 'B'],
        'Category': ['Electronics', 'Clothing', 'Electronics', 'Home Goods', 'Clothing', 'Home Goods', 'Electronics', 'Clothing'],
        'Region': ['North', 'South', 'East', 'West', 'North', 'East', 'South', 'West'],
        'Price': [100, 50, 120, 30, 60, 40, 110, 55],
        'Units Sold': [10, 25, 15, 30, 20, 35, 12, 22]}

df_practice = pd.DataFrame(data)
print("Practice DataFrame:\n", df_practice)

Practice DataFrame:
   Product     Category Region  Price  Units Sold
0       A  Electronics  North    100          10
1       B     Clothing  South     50          25
2       A  Electronics   East    120          15
3       C   Home Goods   West     30          30
4       B     Clothing  North     60          20
5       C   Home Goods   East     40          35
6       A  Electronics  South    110          12
7       B     Clothing   West     55          22

In [32]:
df2=df_practice

In [33]:
df2[(df2['Price'] >50)]

  Product     Category Region  Price  Units Sold
0       A  Electronics  North    100          10
2       A  Electronics   East    120          15
4       B     Clothing  North     60          20
6       A  Electronics  South    110          12
7       B     Clothing   West     55          22

In [36]:
df2[(df2['Category'] == 'Electronics') & (df2['Region']=='North') &(df2['Product']=='A')]

  Product     Category Region  Price  Units Sold
0       A  Electronics  North    100          10

In [37]:
df2[(df2['Category'] == 'Home Goods') | (df2['Price']>110) ]

  Product     Category Region  Price  Units Sold
2       A  Electronics   East    120          15
3       C   Home Goods   West     30          30
5       C   Home Goods   East     40          35

In [40]:
df2[~(df2['Category'] == 'Home Goods') | (df2['Price']>110) ]

  Product     Category Region  Price  Units Sold
0       A  Electronics  North    100          10
1       B     Clothing  South     50          25
2       A  Electronics   East    120          15
4       B     Clothing  North     60          20
6       A  Electronics  South    110          12
7       B     Clothing   West     55          22